In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df_tesla = pd.read_csv("TESLA Search Trend vs Price.csv")

In [3]:
df_tesla.head()

        MONTH  TSLA_WEB_SEARCH  TSLA_USD_CLOSE
0  2010-06-01                3           4.766
1  2010-07-01                3           3.988
2  2010-08-01                2           3.896
3  2010-09-01                2           4.082
4  2010-10-01                2           4.368

In [4]:
print("This is a simple df, it consists of 3 columns, depicting a month, num of tesla searches and the closing price. ")

This is a simple df, it consists of 3 columns, depicting a month, num of tesla searches and the closing price.

In [5]:
print(f"Size of data: {df_tesla.shape}")

Size of data: (124, 3)

In [6]:
print("we have 124 rows and 3 columns")

we have 124 rows and 3 columns

In [7]:
print(f"The columns are: {df_tesla.columns}")

The columns are: Index(['MONTH', 'TSLA_WEB_SEARCH', 'TSLA_USD_CLOSE'], dtype='object')

In [8]:
print("Let us look at some antibiotics")

Let us look at some antibiotics

In [9]:
df_tesla.describe()

       TSLA_WEB_SEARCH  TSLA_USD_CLOSE
count       124.000000      124.000000
mean          8.725806       50.962145
std           5.870332       65.908389
min           2.000000        3.896000
25%           3.750000        7.352500
50%           8.000000       44.653000
75%          12.000000       58.991999
max          31.000000      498.320007

In [10]:
print("The mean number of searches is a measure for the avg number of searches, can be affected by outliers \n")
print("The mean number for closing price is a measure for the avg closing price, can be affeced by outliers \n")
print("The standard deviation value is a depiction of how varied values are from the mean, the standard deviation for tesla is high\n")
print("This means that most closing prices are further from the mean\n")
print("We also have Q1-Q2-Q3\n")
print("We notice that the highest number of searches for some date is 31\n")
print("The max closing price is $498, this is an absolute ridiculous value as opposed to the mean")

The mean number of searches is a measure for the avg number of searches, can be affected by outliers

The mean number for closing price is a measure for the avg closing price, can be affeced by outliers

The standard deviation value is a depiction of how varied values are from the mean, the standard deviation for tesla is high

This means that most closing prices are further from the mean

We also have Q1-Q2-Q3

We notice that the highest number of searches for some date is 31

The max closing price is $498, this is an absolute ridiculous value as opposed to the mean

In [11]:
# What is the periodicity of the time series data?

In [12]:
df_tesla.MONTH

0      2010-06-01
1      2010-07-01
2      2010-08-01
3      2010-09-01
4      2010-10-01
          ...
119    2020-05-01
120    2020-06-01
121    2020-07-01
122    2020-08-01
123    2020-09-01
Name: MONTH, Length: 124, dtype: object

In [13]:
df_tesla.MONTH = pd.to_datetime(df_tesla.MONTH) # Let us convert the column into a datetime month

In [14]:
print(f" Let us grab a sample subtraction to see what time frame we are working with {df_tesla.MONTH[1] - df_tesla.MONTH[0]}")

 Let us grab a sample subtraction to see what time frame we are working with 30 days 00:00:00

In [15]:
print("Let us shift values 1 forward so we can minus all rows from prior row")
df_tesla.MONTH.shift(1) - df_tesla.MONTH

Let us shift values 1 forward so we can minus all rows from prior row

0          NaT
1     -30 days
2     -31 days
3     -31 days
4     -30 days
        ...
119   -30 days
120   -31 days
121   -30 days
122   -31 days
123   -31 days
Name: MONTH, Length: 124, dtype: timedelta64[ns]

In [16]:
print("We conclude 1 month as periodicity")

We conclude 1 month as periodicity

In [47]:
df_unemployed = pd.read_csv("UE Benefits Search vs UE Rate 2004-20.csv")

In [48]:
df_unemployed.head()

     MONTH  UE_BENEFITS_WEB_SEARCH  UNRATE
0  2004-01                       9     5.7
1  2004-02                       8     5.6
2  2004-03                       7     5.8
3  2004-04                       8     5.6
4  2004-05                       6     5.6

In [19]:
print(f"How many rows and columns do we have in the unemployment df: {unemployed_df.shape}")

How many rows and columns do we have in the unemployment df: (200, 3)

In [49]:

df_unemployed.columns

Index(['MONTH', 'UE_BENEFITS_WEB_SEARCH', 'UNRATE'], dtype='object')

In [21]:
unemployed_df.describe()

       UE_BENEFITS_WEB_SEARCH      UNRATE
count              200.000000  200.000000
mean                10.315000    6.173000
std                 10.778061    2.128267
min                  4.000000    3.500000
25%                  5.000000    4.600000
50%                  7.000000    5.400000
75%                 12.000000    7.825000
max                100.000000   14.700000

In [46]:

print("The standard deviation of the unrate is lower than the mean, indicating there is little variance in the " 
      "data values \nWe can say that the UE rate has remained stable, excluding the rate at 14%")

The standard deviation of the unrate is lower than the mean, indicating there is little variance in the data values
We can say that the UE rate has remained stable, excluding the rate at 14%

In [23]:
unemployed_df.head()

     MONTH  UE_BENEFITS_WEB_SEARCH  UNRATE
0  2004-01                       9     5.7
1  2004-02                       8     5.6
2  2004-03                       7     5.8
3  2004-04                       8     5.6
4  2004-05                       6     5.6

In [52]:
df_unemployed.MONTH =  pd.to_datetime(df_unemployed.MONTH)

In [53]:
# Let us find periodicity
df_unemployed.MONTH.shift(1) - df_unemployed.MONTH

0          NaT
1     -31 days
2     -29 days
3     -31 days
4     -30 days
        ...
195   -31 days
196   -30 days
197   -31 days
198   -30 days
199   -31 days
Name: MONTH, Length: 200, dtype: timedelta64[ns]

In [26]:
print("Again 1 month")

Again 1 month

In [27]:
df_bitcoin_search_tread = pd.read_csv("Bitcoin Search Trend.csv")

In [28]:
df_bitcoin_daily_price = pd.read_csv("Daily Bitcoin Price.csv")

In [29]:
df_bitcoin_search_tread.head()

     MONTH  BTC_NEWS_SEARCH
0  2014-09                5
1  2014-10                4
2  2014-11                4
3  2014-12                4
4  2015-01                5

In [30]:
df_bitcoin_daily_price.head()

         DATE       CLOSE      VOLUME
0  2014-09-17  457.334015  21056800.0
1  2014-09-18  424.440002  34483200.0
2  2014-09-19  394.795990  37919700.0
3  2014-09-20  408.903992  36863600.0
4  2014-09-21  398.821014  26580100.0

In [31]:
# Can we combine these? Well we have 2 time columns that are different so no

In [32]:
df_bitcoin_search_tread.shape

(73, 2)

In [33]:
df_bitcoin_daily_price.shape # 2204 days of data

(2204, 3)

In [34]:
df_bitcoin_daily_price.describe()

              CLOSE        VOLUME
count   2203.000000  2.203000e+03
mean    4429.421245  8.043622e+09
std     4148.150071  1.176529e+10
min      178.102997  5.914570e+06
25%      433.629502  6.029915e+07
50%     3637.520020  2.018890e+09
75%     7997.372803  1.322478e+10
max    19497.400391  7.415677e+10

In [35]:
df_bitcoin_search_tread.describe()

       BTC_NEWS_SEARCH
count        73.000000
mean         15.013699
std          15.146959
min           3.000000
25%           5.000000
50%          14.000000
75%          18.000000
max         100.000000

In [36]:
# Are there any missing data in our tables?

In [55]:
df_tesla.isna() # nothing here

     MONTH  TSLA_WEB_SEARCH  TSLA_USD_CLOSE
0    False            False           False
1    False            False           False
2    False            False           False
3    False            False           False
4    False            False           False
..     ...              ...             ...
119  False            False           False
120  False            False           False
121  False            False           False
122  False            False           False
123  False            False           False

[124 rows x 3 columns]

In [68]:
df_unemployed.isnull().values.any() # Nothing here

False

In [67]:
df_bitcoin_daily_price.isnull().values.any() # There is a null value someone

True

In [71]:
df_bitcoin_search_tread.isnull().values.any() # Clean

False

In [72]:
print("We need to find the nan value(s) in bitcoin price table and take care of it")

We need to find the nan value(s) in bitcoin price table and take care of it

In [74]:
df_bitcoin_daily_price.isnull()

       DATE  CLOSE  VOLUME
0     False  False   False
1     False  False   False
2     False  False   False
3     False  False   False
4     False  False   False
...     ...    ...     ...
2199  False  False   False
2200  False  False   False
2201  False  False   False
2202  False  False   False
2203  False  False   False

[2204 rows x 3 columns]

In [88]:
df_bitcoin_daily_price[df_bitcoin_daily_price.isna().any(axis=1)] # Find any rows with nan values

            DATE  CLOSE  VOLUME
2148  2020-08-04    NaN     NaN

In [89]:
print(" We do not need this row so we can just delete it?")

 We do not need this row so we can just delete it?

In [90]:
df_bitcoin_daily_price.dropna(inplace=True)

In [92]:
df_bitcoin_daily_price[df_bitcoin_daily_price.isna().any(axis=1)] # Confirm we removed nan values

Empty DataFrame
Columns: [DATE, CLOSE, VOLUME]
Index: []

In [93]:
df_tesla.dtypes

MONTH              datetime64[ns]
TSLA_WEB_SEARCH             int64
TSLA_USD_CLOSE            float64
dtype: object

In [94]:
df_unemployed.dtypes

MONTH                     datetime64[ns]
UE_BENEFITS_WEB_SEARCH             int64
UNRATE                           float64
dtype: object

In [96]:
df_bitcoin_daily_price.DATE = pd.to_datetime(df_bitcoin_daily_price.DATE)

In [97]:
df_bitcoin_daily_price.dtypes

DATE      datetime64[ns]
CLOSE            float64
VOLUME           float64
dtype: object

In [99]:
df_bitcoin_search_tread.MONTH = pd.to_datetime(df_bitcoin_search_tread.MONTH)

In [100]:
df_bitcoin_search_tread.dtypes

MONTH              datetime64[ns]
BTC_NEWS_SEARCH             int64
dtype: object

Resampling Time Series Data
Next, we have to think about how to make our Bitcoin price and our Bitcoin search volume comparable. 
Our Bitcoin price is daily data, but our Bitcoin Search Popularity is monthly data.

In [101]:
print("If we need to convert a columns value to fit a different time frame we can use the resample function")

If we need to convert a columns value to fit a different time frame we can use the resample function

In [105]:
df_bitcoin_monthly_price = df_bitcoin_daily_price.resample('M', on='DATE').last()

In [107]:
df_bitcoin_monthly_price # Coverted daily closing price to monthly closing price considering the last 30's date price

                   CLOSE        VOLUME
DATE
2014-09-30    386.944000  3.470730e+07
2014-10-31    338.321014  1.254540e+07
2014-11-30    378.046997  9.194440e+06
2014-12-31    320.192993  1.394290e+07
2015-01-31    217.464005  2.334820e+07
...                  ...           ...
2020-05-31   9461.058594  2.777329e+10
2020-06-30   9137.993164  1.573580e+10
2020-07-31  11323.466797  2.316047e+10
2020-08-31  11680.820313  2.228593e+10
2020-09-30  10912.536133  2.122653e+10

[73 rows x 2 columns]